In [2]:
# "2020-12-25" -> "20201225"
'2020-12-25'.replace('-', '')

'20201225'

In [7]:
[i for i in range(1, 11)]
list(range(1, 11))

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [18]:
x = {"a": 10, "b": 20}
len(x)
x['a'] = 11
x
x['c'] = 30
x
del x['c']
x
for i in x:  # 딕셔너리의 키 값만
    print(i)

for i in x.values():  # values(): 딕셔너리의 밸류만
    print(i)

for i, j in x.items():  # items(): 딕셔너리의 키, 밸류 모두
    print(i, j)

a
b
11
20
a 11
b 20

In [25]:
import datetime as dt

x = dt.datetime.now()

x.year 
x.weekday()  # {0:월, 1:화, 2:수, 3:목, 4:금, 5:토, 6:일}

print(f'{x.year}년 {x.month}월 {x.day}일')

2022년 10월 8일

In [37]:
import numpy as np

arr = np.array(range(1, 11))
type(arr)
2 * arr

arr.ndim  # 1
arr.size  # 10
arr.shape  # (10,)

a = np.array([[0, 1, 2, 3], [4, 5, 6, 7]])
a[0, :]  # 첫 번째 행 전체
a[:, 1]  # 두 번째 열 전체
a[1, 1:] # 두 번째 행의 두 번째 열부터 끝 열까지

array([5, 6, 7])

In [49]:
import pandas as pd
import seaborn as sns

titanic = sns.load_dataset('titanic')
titanic.head(10)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False